Autodesk.Revit.Exceptions.CentralModelIncompatibleRelinquishException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.CentralModelIncompatibleRelinquishException
The exception thrown when the user has been force relinquished from the model.
This leaves the local model incompatible with the central model.